Autodesk.Revit.DB.VerticalAlignmentStyle
Declares the vertical alignment style of font.
Since:
2011

Autodesk.Revit.DB.VerticalAlignmentStyle.Bottom
Alignment to bottom

Autodesk.Revit.DB.VerticalAlignmentStyle.Middle
Alignment to middle

Autodesk.Revit.DB.VerticalAlignmentStyle.Top
Alignment to top